Repository: tianpingdeng112233-cell/meetpr
Catalog: Modules/CoachKit/Sources/CoachKit/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en

# coach.applicationProfile.accept
source: 接收
en: Accept

# coach.applicationProfile.age
source: {age} 岁
en: Age {age}

# coach.applicationProfile.back
source: 返回
en: Back

# coach.applicationProfile.basicInfo
source: 基础信息
en: Basic Info

# coach.applicationProfile.focus
source: 想增强
en: Focus Areas

# coach.applicationProfile.heSaid
source: 他说
en: He Said

# coach.applicationProfile.ignore
source: 忽略
en: Ignore

# coach.applicationProfile.injuryHistory
source: 伤病史
en: Injury History

# coach.applicationProfile.selfReportedOneRM
source: 自报 1RM
en: Self-reported 1RM

# coach.applicationProfile.sheSaid
source: 她说
en: She Said

# coach.applicationProfile.targetMeet
source: 目标比赛
en: Target Meet

# coach.applicationProfile.theySaid
source: 他/她说
en: Student Said

# coach.applicationProfile.title
source: {name} · 申请资料
en: {name} · Application Profile

# coach.applicationProfile.trainingEnvironment
source: 训练环境
en: Training Environment

# coach.applicationProfile.trainingHistory
source: 训练年限 / 频率
en: Training History / Frequency

# coach.applicationProfile.unavailable
source: 学员尚未填写资料
en: Unavailable

# coach.applicationProfile.unavailableSubtitle
source: 可以直接接收或忽略；请求过期时返回学员页会自动刷新
en: You can accept or ignore this request. The list refreshes after expiry.

# coach.applicationProfile.weeklyFrequency %lld
source: 每周 %lld 次
en: %lld sessions/week

# coach.bind.accept.confirm
source: 确认接收
en: Confirm

# coach.bind.accept.confirmQuestion
source: 确认接收 {student} 为学员?
en: Accept {student} as your student?

# coach.bind.accept.explanation
source: 接收后即可为其查看资料、编排训练计划。
en: Once accepted, you can view their profile and create training plans.

# coach.bind.accept.title
source: 接收新学员
en: Accept New Student

# coach.bind.accepted
source: 已接收
en: Accepted

# coach.bind.acceptedEvaluation
source: 已接收,评估期 7 天开始
en: Accepted, 7-day evaluation started

# coach.bind.bench.narrow
source: 窄握
en: Narrow

# coach.bind.bench.standard
source: 标准
en: Standard

# coach.bind.bench.wide
source: 宽握
en: Wide

# coach.bind.card.accept
source: 接收
en: Accept

# coach.bind.card.accessibility
source: 新学员请求 {student}
en: New student request from {student}

# coach.bind.card.age %lld
source: %lld 岁
en: %lld years old

# coach.bind.card.competition
source: 备赛: {date}
en: Meet: {date}

# coach.bind.card.expiring
source: 即将过期
en: Expiring Soon

# coach.bind.card.noUploads
source: 无上传资料
en: No uploaded files

# coach.bind.card.note
source: 备注: {note}
en: Note: {note}

# coach.bind.card.profileIncomplete
source: 资料未填写完成
en: Profile incomplete

# coach.bind.card.reject
source: 拒绝
en: Reject

# coach.bind.card.strengthen
source: 想增强: {groups}
en: Focus: {groups}

# coach.bind.card.uploadCount %lld
source: 资料 %lld 份
en: %lld files

# coach.bind.card.viewProfile
source: 查看完整资料
en: View Full Profile

# coach.bind.deadlift.both
source: 两种都练
en: Both

# coach.bind.deadlift.conventional
source: 传统
en: Conventional

# coach.bind.deadlift.sumo
source: 相扑
en: Sumo

# coach.bind.equipment.barbellDumbbell
source: 杠铃 + 哑铃
en: Barbell + Dumbbell

# coach.bind.equipment.beltSquat
source: 腰带深蹲机
en: Belt Squat

# coach.bind.equipment.blocksChainsBands
source: 块铃 / 链子 / 弹力带
en: Blocks / Chains / Bands

# coach.bind.equipment.cableCrossover
source: 龙门架(大飞鸟)
en: Cable Crossover

# coach.bind.equipment.cableLatPulldown
source: 拉力机 / 高位下拉
en: Cable / Lat Pulldown

# coach.bind.equipment.chainsBands
source: 链条 / 弹力带(变阻)
en: Chains / Bands

# coach.bind.equipment.dbMax20
source: 哑铃 ≤20kg
en: Dumbbells ≤20kg

# coach.bind.equipment.dbMax40
source: 哑铃 ≤40kg
en: Dumbbells ≤40kg

# coach.bind.equipment.dbMax40Plus
source: 哑铃 >40kg
en: Dumbbells >40kg

# coach.bind.equipment.deadliftBar
source: 硬拉专项杆(软杆)
en: Deadlift Bar

# coach.bind.equipment.fractionalPlates
source: 微增片(0.25kg 起)
en: Fractional Plates (from 0.25kg)

# coach.bind.equipment.ghr
source: GHR(臀腿举)
en: GHR

# coach.bind.equipment.hackSquat
source: 哈克深蹲机
en: Hack Squat

# coach.bind.equipment.heavyDumbbells
source: 哑铃区(>30kg)
en: Heavy Dumbbells (>30kg)

# coach.bind.equipment.landmine
source: 地雷架(含 T 杆划船)
en: Landmine (incl. T-bar row)

# coach.bind.equipment.latPulldown
source: 高位下拉
en: Lat Pulldown

# coach.bind.equipment.legCurlExtension
source: 腿弯举 / 腿屈伸
en: Leg Curl / Extension

# coach.bind.equipment.legPress
source: 倒蹬机 / 腿举机
en: Leg Press

# coach.bind.equipment.liftingPlatform
source: 举重台 / 硬拉台
en: Lifting / Deadlift Platform

# coach.bind.equipment.powerBar
source: 力量举专项杆(硬杆)
en: Power Bar

# coach.bind.equipment.pullupBar
source: 引体向上杆
en: Pull-up Bar

# coach.bind.equipment.rackPinsBlocks
source: 架上销 / 垫块
en: Rack Pins / Blocks

# coach.bind.equipment.reverseHyper
source: 反向过伸机
en: Reverse Hyper

# coach.bind.equipment.safetyBar
source: 特种杠(SSB / 六角等)
en: Specialty Bar (SSB / trap, etc.)

# coach.bind.equipment.sealRow
source: 海豹划船凳
en: Seal Row Bench

# coach.bind.equipment.seatedRow
source: 坐姿划船
en: Seated Row

# coach.bind.equipment.smithMachine
source: 史密斯架
en: Smith Machine

# coach.bind.equipment.squatBenchRack
source: 深蹲架 + 卧推架
en: Squat Rack + Bench

# coach.bind.error.alreadyBound
source: 你们已是绑定关系
en: This student is already linked to you

# coach.bind.error.expired
source: 该请求已过期
en: This request has expired

# coach.bind.error.network
source: 网络异常,请稍后重试
en: Network error. Try again later.

# coach.bind.error.processed
source: 该请求已被处理
en: This request has already been processed

# coach.bind.gender.female
source: 女
en: Female

# coach.bind.gender.male
source: 男
en: Male

# coach.bind.gender.other
source: 其他
en: Other

# coach.bind.gym.commercial
source: 商业健身房
en: Commercial Gym

# coach.bind.gym.homeWithRack
source: 家庭(含深蹲架)
en: Home Gym (with rack)

# coach.bind.gym.professional
source: 专业力量房
en: Powerlifting Gym

# coach.bind.injury.ankle
source: 踝
en: Ankle

# coach.bind.injury.elbow
source: 肘
en: Elbow

# coach.bind.injury.hip
source: 髋
en: Hip

# coach.bind.injury.knee
source: 膝
en: Knee

# coach.bind.injury.lowerBack
source: 下背
en: Lower Back

# coach.bind.injury.other
source: 其他
en: Other

# coach.bind.injury.shoulder
source: 肩
en: Shoulder

# coach.bind.injury.wrist
source: 腕
en: Wrist

# coach.bind.scale.daily.1
source: 很低
en: Very Low

# coach.bind.scale.daily.2
source: 较低
en: Low

# coach.bind.scale.daily.3
source: 中等
en: Moderate

# coach.bind.scale.daily.4
source: 较高
en: High

# coach.bind.scale.daily.5
source: 极高
en: Very High

# coach.bind.scale.recovery.1
source: 3天以上
en: 3+ days

# coach.bind.scale.recovery.2
source: 约3天
en: About 3 days

# coach.bind.scale.recovery.3
source: 约2天
en: About 2 days

# coach.bind.scale.recovery.4
source: 约1天
en: About 1 day

# coach.bind.scale.recovery.5
source: 半天内
en: Within half a day

# coach.bind.scale.stress.1
source: 几乎无
en: Almost None

# coach.bind.scale.stress.2
source: 较低
en: Low

# coach.bind.scale.stress.3
source: 中等
en: Moderate

# coach.bind.scale.stress.4
source: 较高
en: High

# coach.bind.scale.stress.5
source: 极高
en: Very High

# coach.bind.squat.highBar
source: 高杠
en: High Bar

# coach.bind.squat.lowBar
source: 低杠
en: Low Bar

# coach.bind.training.lessThanOne
source: 训练 <1 年
en: Training <1 year

# coach.bind.training.tenPlus
source: 训练 10+ 年
en: Training 10+ years

# coach.bind.training.years %lld
source: 训练 %lld 年
en: Training %lld years

# coach.bind.waiting.days %lld
source: 已等待 %lld 天
en: Waiting %lld days

# coach.bind.waiting.hours %lld
source: 已等待 %lld 小时
en: Waiting %lld hours

# coach.bind.waiting.hoursMinutes %lld %lld
source: 已等待 %lld 小时 %lld 分
en: Waiting %lld hr %lld min

# coach.bind.waiting.minutes %lld
source: 已等待 %lld 分钟
en: Waiting %lld minutes

# coach.bind.weekday.fri
source: 周五
en: Fri

# coach.bind.weekday.mon
source: 周一
en: Mon

# coach.bind.weekday.sat
source: 周六
en: Sat

# coach.bind.weekday.sun
source: 周日
en: Sun

# coach.bind.weekday.thu
source: 周四
en: Thu

# coach.bind.weekday.tue
source: 周二
en: Tue

# coach.bind.weekday.wed
source: 周三
en: Wed

# coach.chat.activeStudentSubtitle
source: ● 学员 · 活跃
en: ● Student · Active

# coach.chat.attentionStudentSubtitle
source: ● 学员 · 待关注
en: ● Student · Needs Attention

# coach.chat.messages
source: 消息
en: Messages

# coach.chat.ok
source: 好
en: OK

# coach.chat.sendMessage
source: 发消息
en: Message

# coach.chat.unableToOpenConversation
source: 无法打开会话，请重试
en: Could not open conversation. Try again.

# coach.common.cancel
source: 取消
en: Cancel

# coach.common.loadFailed
source: 加载失败
en: Load Failed

# coach.common.notSelected
source: 未选中
en: Not selected

# coach.common.retry
source: 重试
en: Retry

# coach.common.save
source: 保存
en: Save

# coach.common.selected
source: 已选中
en: Selected

# coach.detail.active
source: 活跃
en: Active

# coach.detail.adjusted
source: 已调整
en: Adjusted

# coach.detail.back
source: 返回
en: Back

# coach.detail.backToStudents
source: 学员
en: Students

# coach.detail.chat
source: 消息
en: Chat

# coach.detail.completed
source: 已完成
en: Completed

# coach.detail.evaluationDays %lld
source: 评估期 %lld 天
en: Evaluation · %lld days

# coach.detail.evaluationHours %lld
source: 评估期 %lld 小时
en: Evaluation · %lld hours

# coach.detail.evaluationLoadFailed
source: 评估状态加载失败
en: Evaluation Load Failed

# coach.detail.feedbackMeta
source: {relativeTime} · 看全部 →
en: {relativeTime} · View all →

# coach.detail.loadFailed
source: 加载失败
en: Load Failed

# coach.detail.loading
source: 加载学员详情…
en: Loading

# coach.detail.needsAttention
source: 待关注
en: Needs Attention

# coach.detail.noPlan
source: 还没有计划
en: No plan yet

# coach.detail.noPlanSubtitle
source: 去计划页为这位学员排一份
en: Create a plan for this student from planning

# coach.detail.planLoadFailed
source: 计划加载失败
en: Could not load the plan

# coach.detail.noFeedback
source: 还没有反馈
en: No feedback yet

# coach.detail.noTrainingThisWeek
source: 本周还没有训练安排
en: No Training Days This Week

# coach.detail.notStarted
source: 未开始
en: Not Started

# coach.detail.profileUnavailable
source: 注册资料暂时无法获取
en: Registration profile unavailable

# coach.detail.pullToRetry
source: 下拉刷新重试
en: Pull To Retry

# coach.detail.readinessReminderDraft
source: 提醒填写今日状态
en: Remember to log today’s readiness.

# coach.detail.recentFeedback
source: 最近反馈
en: Recent Feedback

# coach.detail.remindToFile
source: 提醒填写
en: Send reminder

# coach.detail.remindTraining
source: 提醒训练
en: Remind to train

# coach.detail.retry
source: 重试
en: Retry

# coach.detail.section.feedback
source: 反馈
en: Feedback

# coach.detail.section.growth
source: 成长
en: Progress

# coach.detail.section.overview
source: 概览
en: Overview

# coach.detail.section.profile
source: 资料
en: Profile

# coach.detail.section.videos
source: 视频
en: Videos

# coach.detail.statusUnavailable
source: 暂时无法获取
en: Status Unavailable

# coach.detail.tapDayForDetails
source: 点某天查看详情
en: Tap Day For Details

# coach.detail.today
source: 今天
en: Today

# coach.detail.todayNotFiled
source: 今日未填
en: Today Not Filed

# coach.detail.todayStatus
source: 今日状态
en: Today's Readiness

# coach.detail.training
source: 训练
en: Training

# coach.detail.trainingReminderDraft
source: 提醒训练
en: Remember to train today.

# coach.detail.weekProgress %lld %lld
source: 本周 %lld/%lld 训练日
en: This week %1$lld/%lld training days

# coach.detail.weekRunningTitle %lld
source: W%lld 在跑
en: W%lld in progress

# coach.detail.weekSummary
source: 本周总结
en: Week Summary

# coach.detail.weekSummaryUnavailable
source: 本卡不提供本周总结
en: Weekly summary is not available here

# coach.detail.weekTraining
source: 本周训练
en: Week Training

# coach.detail.weekday.fri
source: 周五
en: Fri

# coach.detail.weekday.mon
source: 周一
en: Mon

# coach.detail.weekday.sat
source: 周六
en: Sat

# coach.detail.weekday.sun
source: 周日
en: Sun

# coach.detail.weekday.thu
source: 周四
en: Thu

# coach.detail.weekday.tue
source: 周二
en: Tue

# coach.detail.weekday.wed
source: 周三
en: Wed

# coach.detail.writeFirstFeedback
source: 去视频页写第一条 →
en: Write the first feedback from Videos →

# coach.evaluation.complete
source: 完成评估
en: Complete Evaluation

# coach.evaluation.complete.anyway
source: 仍然完成
en: Complete Anyway

# coach.evaluation.complete.confirmation
source: 完成后即可发布正式 4 周计划。还没写评估总结的话,建议先写总结再完成。
en: Completing this unlocks regular 4-week plans. If you have not written the summary, write it first.

# coach.evaluation.complete.writeSummary
source: 先写总结
en: Write Summary First

# coach.evaluation.duration.days %lld
source: %lld 天
en: %lld days

# coach.evaluation.duration.hours %lld
source: %lld 小时
en: %lld hours

# coach.evaluation.error.complete
source: 完成评估失败,请稍后重试
en: Could not complete evaluation. Try again later.

# coach.evaluation.overdue
source: 已超期 {duration},请尽快交付总结
en: Overdue by {duration}. Please deliver the summary soon.

# coach.evaluation.remaining %lld %lld
source: 评估期 · 还剩 %lld 天 %lld 小时
en: Evaluation · %lld days %lld hours remaining

# coach.evaluation.sendAdaptation
source: 发适应周
en: Send Adaptation Week

# coach.evaluation.summary
source: 评估总结
en: Evaluation Summary

# coach.evaluation.summary.completeFailed
source: 总结已保存,但完成评估失败,请在学员详情页重试
en: Summary saved, but evaluation completion failed. Retry from student details.

# coach.evaluation.summary.completeNotify
source: 完成并通知学员
en: Complete & Notify Student

# coach.evaluation.summary.completedAlert
source: 评估完成,{student} 已收到通知。
en: Evaluation complete. {student} has been notified.

# coach.evaluation.summary.later
source: 稍后
en: Later

# coach.evaluation.summary.loadFailed
source: 评估总结加载失败,请返回重试
en: Could not load the evaluation summary. Go back and retry.

# coach.evaluation.summary.navigationTitle
source: 评估总结 · {student}
en: Evaluation Summary · {student}

# coach.evaluation.summary.notifyStudent
source: 同时通知学员
en: Notify Student Too

# coach.evaluation.summary.overall
source: 整体评估 · 必填
en: Overall Assessment · Required

# coach.evaluation.summary.planNow
source: 立即排
en: Plan Now

# coach.evaluation.summary.planPrompt
source: 要不要立即为他排第一份正式计划?
en: Create their first regular plan now?

# coach.evaluation.summary.profileMissing
source: 学员资料未读到,手动填写
en: Student profile unavailable. Fill it in manually.

# coach.evaluation.summary.saveDraft
source: 保存草稿
en: Save Draft

# coach.evaluation.summary.saveFailed
source: 保存失败,请重试
en: Save failed. Try again.

# coach.evaluation.summary.saved
source: 已保存 {time}
en: Saved {time}

# coach.evaluation.summary.trainingPlan
source: 训练规划 · 必填
en: Training Plan · Required

# coach.evaluation.summary.words
source: 给学员的话 · 选填
en: Message to Student · Optional

# coach.evaluation.title
source: 评估期
en: Evaluation Period

# coach.evaluation.viewAdaptation
source: 查看适应周
en: View Adaptation Week

# coach.execution.empty
source: 暂无执行记录
en: No Training Records

# coach.execution.freeLog
source: 自由记录
en: Free Log

# coach.execution.loggedSets %lld
source: %lld 组已记录
en: %lld sets logged

# coach.execution.loggedSetsFraction %lld %lld
source: %lld/%lld 组已记录
en: %1$lld/%lld sets logged

# coach.execution.noLoggedSets
source: 暂无已记录组
en: No logged sets

# coach.execution.rest
source: 休息
en: Rest

# coach.execution.restDay
source: 休息日
en: Rest Day

# coach.execution.setFraction %lld %lld
source: %lld/%lld 组
en: %1$lld/%lld sets

# coach.feedback.content
source: 反馈内容
en: Feedback

# coach.feedback.date
source: 日期
en: Date

# coach.feedback.empty
source: 还没有反馈
en: No feedback yet

# coach.feedback.error.empty
source: 反馈不能为空
en: Feedback cannot be empty

# coach.feedback.error.send
source: 发送失败，请稍后重试
en: Send failed. Try again later.

# coach.feedback.exercise
source: 动作
en: Exercise

# coach.feedback.eyebrow
source: 文本反馈 //
en: TEXT FEEDBACK //

# coach.feedback.link
source: 关联
en: Link

# coach.feedback.notLinked
source: 不关联
en: Not linked

# coach.feedback.placeholder
source: 给 {student} 写反馈...
en: Write feedback for {student}...

# coach.feedback.recordCount %lld
source: 反馈记录 · %lld
en: Feedback · %lld

# coach.feedback.send
source: 发送
en: Send

# coach.feedback.title
source: 给 {student} 写反馈
en: Feedback for {student}

# coach.feedback.videoFeedback
source: 训练视频
en: Training Video

# coach.feedback.writeFromVideo
source: 从视频页写反馈
en: Write feedback from a video

# coach.growth.empty
source: 还没有成长数据
en: No progress data yet

# coach.growth.error.load
source: 成长曲线加载失败，请稍后重试
en: Could not load progress. Try again later.

# coach.growth.family.bench
source: 卧推 E1RM
en: Bench press e1RM

# coach.growth.family.deadlift
source: 硬拉 E1RM
en: Deadlift e1RM

# coach.growth.family.squat
source: 深蹲 E1RM
en: Squat e1RM

# coach.growth.noFamilyData
source: 还没有数据
en: No data yet

# coach.growth.oneRMTotal %@
source: 1RM 合计 %@ kg
en: 1RM total %@ kg

# coach.growth.totalE1RM
source: 三项总和 E1RM
en: SBD total e1RM

# coach.growth.totalProgress %@
source: 占 1RM 总和 %@
en: %@ of 1RM total

# coach.growth.trend.down
source: e1RM 趋势下降
en: e1RM trend down

# coach.growth.trend.flat
source: e1RM 趋势持平
en: e1RM trend steady

# coach.growth.trend.up
source: e1RM 趋势上升
en: e1RM trend up

# coach.growth.window.all
source: 全部
en: All

# coach.growth.window.fourWeeks
source: 近 4 周
en: Last 4 Weeks

# coach.growth.window.threeMonths
source: 近 3 月
en: Last 3 Months

# coach.import.boundTo
source: 已绑定：{exercise}
en: Bound: {exercise}

# coach.import.catalogLoadFailed
source: 动作库加载失败：{message}
en: Could not load exercise library: {message}

# coach.import.chooseAnotherFile
source: 重新选择文件
en: Choose Another File

# coach.import.coachNote
source: 教练备注
en: Coach Note

# coach.import.day
source: 第 {day} 天
en: Day {day}

# coach.import.defaultPlanName
source: {student} 导入计划
en: {student}'s Imported Plan

# coach.import.incompleteHint
source: 还有「待你定」的项——补齐重量/RPE、绑定动作后才能发布。
en: Resolve the items marked “Needs Input” before publishing.

# coach.import.needsBinding
source: 待绑定
en: Needs Binding

# coach.import.needsValues
source: 待补值
en: Needs Values

# coach.import.needsYourInput
source: 待你定
en: Needs Input

# coach.import.noSimilarExercise
source: 库里没有相近动作——本组导入需要先在库里有它。
en: No similar exercise exists in the library.

# coach.import.noTrainingWeeks
source: 没能在表里识别出训练周——请确认选择的是计划页。
en: No training weeks were found. Make sure you selected a plan sheet.

# coach.import.parseFailed
source: 解析失败：{message}
en: Parse failed: {message}

# coach.import.pickFileDescription
source: 把电脑上的 .xlsx 计划表 AirDrop 到手机，选它导入。解析在本机完成，文件不上传。
en: AirDrop an .xlsx plan to your phone and select it here. Parsing stays on device.

# coach.import.planName
source: 计划名
en: Plan Name

# coach.import.publishFailed
source: 发布失败：{message}
en: Publish failed: {message}

# coach.import.publishToStudent
source: 发布给学员
en: Publish to Student

# coach.import.publishable
source: 可发布
en: Ready to Publish

# coach.import.publishedTo
source: 已发布给 {student}
en: Published to {student}

# coach.import.review
source: 导入审阅
en: Import Review

# coach.import.selectStudent
source: 请选择学员
en: Select a student

# coach.import.selectXLSXFile
source: 选择 .xlsx 文件
en: Select .xlsx File

# coach.import.setNumber %lld
source: 第 %lld 组
en: Set %lld

# coach.import.sourceWeek %lld
source: 原表第 %lld 周
en: Source Week %lld

# coach.import.startDate
source: 开始日（默认下周一）
en: Start Date (defaults to next Monday)

# coach.import.studentLoadFailed
source: 学员加载失败：{message}
en: Could not load students: {message}

# coach.import.summary.weekSelectedWeek
source: 共解析出 {parsed} 周 · 选中 {selected} 周
en: Parsed {parsed} week · {selected} week selected

# coach.import.summary.weekSelectedWeeks
source: 共解析出 {parsed} 周 · 选中 {selected} 周
en: Parsed {parsed} week · {selected} weeks selected

# coach.import.summary.weeksSelectedWeek
source: 共解析出 {parsed} 周 · 选中 {selected} 周
en: Parsed {parsed} weeks · {selected} week selected

# coach.import.summary.weeksSelectedWeeks
source: 共解析出 {parsed} 周 · 选中 {selected} 周
en: Parsed {parsed} weeks · {selected} weeks selected

# coach.import.title
source: 导入计划
en: Import Plan

# coach.import.weightKilograms
source: 重量kg
en: Weight kg

# coach.inbox.emptySubtitle
source: 学员发来消息或上传待反馈视频时会出现在这里
en: New messages and videos awaiting feedback will appear here

# coach.inbox.emptyTitle
source: 消息都处理完了
en: All caught up

# coach.inbox.eyebrow %lld
source: 消息与视频 · %lld
en: Messages & Videos · %lld

# coach.inbox.hint
source: 点姓名进聊天 · 点黑色数字直接看待反馈的视频
en: Tap a name to chat · Tap the black count to review videos

# coach.inbox.loadFailed
source: 消息加载失败
en: Could not load messages

# coach.inbox.loading
source: 正在加载消息…
en: Loading messages…

# coach.inbox.noMessages
source: 暂无消息
en: No Messages

# coach.inbox.pendingVideoPreview %lld %@
source: %lld 段视频待反馈 · %@
en: %lld videos awaiting feedback · %@

# coach.inbox.pendingVideosAccessibility %@ %lld
source: %@，%lld 段视频待反馈
en: %@, %lld videos awaiting feedback

# coach.inbox.playPendingVideos
source: 查看待反馈视频
en: Play Pending Videos

# coach.inbox.title
source: 消息
en: Messages

# coach.inbox.unreadAccessibility %lld
source: %lld 条未读消息
en: %lld unread messages

# coach.invites.cancel
source: 取消
en: Cancel

# coach.invites.copied
source: 已复制
en: Copied

# coach.invites.copy
source: 复制
en: Copy

# coach.invites.createSingleUse
source: 生成一次性码
en: Create Single Use

# coach.invites.createTimeLimited
source: 生成限时码
en: Create Time Limited

# coach.invites.custom
source: 自定义
en: Custom

# coach.invites.days %lld
source: %lld 天
en: %lld days

# coach.invites.defunctSection
source: 已失效
en: Inactive

# coach.invites.generate
source: 生成
en: Generate

# coach.invites.generatePermanentCode
source: 生成我的永久码
en: Generate Permanent Code

# coach.invites.labelPlaceholder
source: 给小明
en: For Alex

# coach.invites.navigationTitle
source: 我的邀请码
en: My Invite Codes

# coach.invites.noPermanentCode
source: 还没有永久码 — 生成一张,随时分发给新学员。
en: No permanent code yet — generate one to share with new students.

# coach.invites.operationFailed
source: 操作失败,请重试
en: Operation failed. Try again.

# coach.invites.optionalLabel
source: 备注(选填,如学员姓名)
en: Note (optional, e.g. student name)

# coach.invites.personalSection
source: Personal 永久码
en: Personal Permanent Code

# coach.invites.regenerate
source: 重新生成
en: Regenerate

# coach.invites.regenerateMessage
source: 重新生成后旧码立即失效,已分发的旧码将无法使用。
en: The old code will stop working immediately, including copies already shared.

# coach.invites.regenerateTitle
source: 重新生成永久码?
en: Regenerate permanent code?

# coach.invites.revoke
source: 撤销
en: Revoke

# coach.invites.revokeMessage
source: 撤销后该码立即失效。
en: This code will stop working immediately.

# coach.invites.revokeTitle
source: 撤销这个邀请码?
en: Revoke this invite code?

# coach.invites.secondarySection
source: 一次性码 / 限时码
en: Single-use / Time-limited Codes

# coach.invites.sevenDays
source: 7 天
en: Seven Days

# coach.invites.singleUse
source: 一次性
en: Single-use

# coach.invites.singleUseCode
source: + 一次性码
en: Single Use Code

# coach.invites.status.active
source: 待用
en: Active

# coach.invites.status.expired
source: 已过期
en: Expired

# coach.invites.status.expiresIn %lld
source: %lld 天后过期
en: Expires in %lld days

# coach.invites.status.expiring %lld
source: %lld 天后过期
en: Expires in %lld days

# coach.invites.status.revoked
source: 已撤销
en: Revoked

# coach.invites.status.used
source: 已使用
en: Used

# coach.invites.thirtyDays
source: 30 天
en: Thirty Days

# coach.invites.timeLimited
source: 限时
en: Time-limited

# coach.invites.timeLimitedCode
source: + 限时码
en: Time Limited Code

# coach.invites.usedCount %lld
source: 已使用 %lld 次
en: Used %lld times

# coach.invites.validity
source: 有效期
en: Validity

# coach.planning.abnormal.dayNotTrained %lld
source: %lld 天未训练
en: No training for %lld day

# coach.planning.abnormal.daysNotTrained %lld
source: %lld 天未训练
en: No training for %lld days

# coach.planning.abnormal.stuckOnWeek %lld
source: 卡 W%lld 未完成
en: Stuck on W%lld

# coach.planning.common.add
source: 添加
en: Add

# coach.planning.common.all
source: 全部
en: All

# coach.planning.common.cancel
source: 取消
en: Cancel

# coach.planning.common.close
source: 关闭
en: Close

# coach.planning.common.decrease
source: 减少
en: Decrease

# coach.planning.common.delete
source: 删除
en: Delete
